{"information_chunk_1": "About Me – Shlok Kamlesh Chauhan\n\nI’m Shlok Kamlesh Chauhan, a young entrepreneur and tech enthusiast currently pursuing a Bachelor's degree in Computer Science and Engineering at IIIT Vadodara. As someone driven by a passion for innovation, problem-solving, and impact, I have always believed that true change comes from identifying everyday challenges and solving them with purpose-driven action. That philosophy led me to start Blameless, a skincare brand under Vitanix Consumer Pvt. Ltd., with a ", "information_chunk_2": "clear vision: to disrupt India’s stagnant skincare market with clean, effective, and ingredient-conscious products designed specifically for millennials and Gen Z.\n\nBlameless was born out of a simple observation—while global skincare trends were evolving, the Indian market continued to offer either overly commercial or underwhelmingly traditional products. There was a noticeable gap between quality and affordability. I wanted to create something that was modern, science-backed, and honest. That ", "information_chunk_3": "meant building a brand that was not only rooted in transparency but also committed to real results. Today, Blameless offers innovative formulations like targeted serums and a revolutionary 3-in-1 facewash, tailored to suit Indian skin and climate conditions, with a strong emphasis on D2C growth and digital-first strategies.\n\nBeyond my startup journey, I am an active member of the entrepreneurship ecosystem at my institute and serve as the E-Cell Coordinator at IIIT Vadodara. Organizing entrepren", "information_chunk_4": "eurial meetups, hosting idea incubations, and connecting students with industry leaders has allowed me to stay plugged into the startup community while nurturing my leadership and collaborative skills. These experiences have also taught me the value of adaptability, resilience, and the courage to take calculated risks—values that I carry into every project I undertake.\n\nTech is another area that excites me deeply. I'm currently working on CineVibe, an AI-powered app aimed at making movie discove", "information_chunk_5": "ry smarter and more personalized. By integrating Retrieval-Augmented Generation (RAG) models into the FAQ and recommendation engine, I aim to bridge the gap between entertainment and AI-driven utility. This intersection of technology, user experience, and storytelling represents the kind of creative problem-solving that fuels my passion.\n\nOn the academic front, my coursework in algorithms, machine learning, and systems design has laid a strong foundation for technical excellence. But more than g", "information_chunk_6": "rades, I believe in applying what I learn—whether it's writing code for real-world applications, analyzing policy impacts on MSMEs in my economics research project, or exploring how tech can empower consumer behavior.\n\nIn everything I do, my goal is to build with intention. Whether it’s crafting a brand, coding a product, or leading a team, I aim to create value that lasts. I’m constantly learning, evolving, and experimenting—not just as an entrepreneur or a student, but as someone deeply commit", "information_chunk_7": "ted to solving real-world problems with integrity, creativity, and empathy", "information_chunk_8": "CineVibe is an AI-powered app designed to revolutionize how people discover movies through personalization and smart recommendations.\n\nIt uses Retrieval-Augmented Generation (RAG) models to understand user input and generate context-aware suggestions and answers.\n\nCineVibe focuses on mood-based discovery, allowing users to search for movies that match their current feelings or vibe.\n\nThe app supports natural language queries, so users can simply type or speak things like \"I want a feel-good come", "information_chunk_9": "dy\" or \"a thriller with a twist ending.\"\n\nIt learns from your watch history, likes, and interactions to continuously improve its recommendation engine.\n\nCineVibe aims to bridge entertainment with AI, offering not just suggestions, but context-rich overviews, trailers, and summaries.\n\nIt features a clean and interactive chat-like interface for an intuitive and modern movie browsing experience.\n\nThe platform caters to Bollywood, Hollywood, regional, and international films, making it inclusive and", "information_chunk_10": " diverse.\n\nTV shows and web series are part of the upcoming expansion roadmap for broader content discovery.\n\nCineVibe prioritizes user privacy—your preferences and data are secure and used solely to improve your app experience.\n\nIt offers cross-platform support, with launches planned on Android, iOS, and a web version.\n\nCineVibe includes watchlist creation, alerts for new releases, and mood-based filters for quick decisions.\n\nThe app supports voice input, making discovery hands-free and seamles", "information_chunk_11": "s.\n\nSocial discovery features are in the pipeline, allowing users to see what their friends are watching and recommending.\n\nCineVibe's mission is to make movie discovery personal, intelligent, and joyful, turning your scrolling time into watching time."}